{"id": "2602.07369", "categories": ["cs.GR"], "pdf": "https://arxiv.org/pdf/2602.07369", "abs": "https://arxiv.org/abs/2602.07369", "authors": ["Julian Knodt", "Xifeng Gao"], "title": "Convex Primitive Decomposition for Collision Detection", "comment": null, "summary": "Creation of collision objects for 3D models is a time-consuming task, requiring modelers to manually place primitives such as bounding boxes, capsules, spheres, and other convex primitives to approximate complex meshes. While there has been work in automatic approximate convex decompositions of meshes using convex hulls, they are not practical for applications with tight performance budgets such as games due to slower collision detection and inability to manually modify the output while maintaining convexity as compared to manually placed primitives. Rather than convex decomposition with convex hulls, we devise an approach for bottom-up decomposition of an input mesh into convex primitives specifically for rigid body simulation inspired by quadric mesh simplification. This approach fits primitives to complex, real-world meshes that provide plausible simulation performance and are guaranteed to enclose the input surface. We test convex primitive decomposition on over 60 models from Sketchfab, showing the algorithm's effectiveness. On this dataset, convex primitive decomposition has lower one-way mean and median Hausdorff and Chamfer distance from the collider to the input compared to V-HACD and CoACD, with less than one-third of the complexity as measured by total bytes for each collider. On top of that, rigid-body simulation performance measured by wall-clock time is consistently improved across 24 tested models."}
{"id": "2602.08549", "categories": ["cs.GT", "cs.FL"], "pdf": "https://arxiv.org/pdf/2602.08549", "abs": "https://arxiv.org/abs/2602.08549", "authors": ["Véronique Bruyère", "Emmanuel Filiot", "Christophe Grandmont", "Jean-François Raskin"], "title": "An Automata-Based Approach to Games with $ω$-Automatic Preferences", "comment": null, "summary": "This paper studies multiplayer turn-based games on graphs in which player preferences are modeled as $ω$-automatic relations given by deterministic parity automata. This contrasts with most existing work, which focuses on specific reward functions. We conduct a computational analysis of these games, starting with the threshold problem in the antagonistic zero-sum case. As in classical games, we introduce the concept of value, defined here as the set of plays a player can guarantee to improve upon, relative to their preference relation. We show that this set is recognized by an alternating parity automaton APW of polynomial size. We also establish the computational complexity of several problems related to the concepts of value and optimal strategy, taking advantage of the $ω$-automatic characterization of value. Next, we shift to multiplayer games and Nash equilibria, and revisit the threshold problem in this context. Based on an APW construction again, we close complexity gaps left open in the literature, and additionally show that cooperative rational synthesis is $\\mathsf{PSPACE}$-complete, while it becomes undecidable in the non-cooperative case."}
{"id": "2602.07687", "categories": ["cs.GR"], "pdf": "https://arxiv.org/pdf/2602.07687", "abs": "https://arxiv.org/abs/2602.07687", "authors": ["Yue Chang", "Peter Yichen Chen", "Eitan Grinspun", "Maurizio M. Chiaramonte"], "title": "Low-Rank Koopman Deformables with Log-Linear Time Integration", "comment": null, "summary": "We present a low-rank Koopman operator formulation for accelerating deformable subspace simulation. Using a Dynamic Mode Decomposition (DMD) parameterization of the Koopman operator, our method learns the temporal evolution of deformable dynamics and predicts future states through efficient matrix evaluations instead of sequential time integration. This yields log-linear scaling in the number of time steps and allows large portions of the trajectory to be skipped while retaining accuracy. The resulting temporal efficiency is especially advantageous for optimization tasks such as control and initial-state estimation, where the objective often depends largely on the final configuration.\n  To broaden the scope of Koopman-based reduced-order models in graphics, we introduce a discretization-agnostic extension that learns shared dynamic behavior across multiple shapes and mesh resolutions. Prior DMD-based approaches have been restricted to a single shape and discretization, which limits their usefulness for tasks involving geometry variation. Our formulation generalizes across both shape and discretization, which enables fast shape optimization that was previously impractical for DMD models. This expanded capability highlights the potential of Koopman operator learning as a practical tool for efficient deformable simulation and design."}
{"id": "2602.07559", "categories": ["cs.AI", "cs.CC", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.07559", "abs": "https://arxiv.org/abs/2602.07559", "authors": ["Kaleem Ullah Qasim", "Jiashu Zhang", "Hao Li", "Muhammad Kafeel Shaheen"], "title": "VERIFY-RL: Verifiable Recursive Decomposition for Reinforcement Learning in Mathematical Reasoning", "comment": "13 pages", "summary": "Training language models to solve complex mathematical problems benefits from curriculum learning progressively training on simpler subproblems. However, existing decomposition methods are often heuristic, offering no guarantees that subproblems are simpler, that solving them aids the parent task, or that their relationships are mathematically grounded. We observe that symbolic differentiation provides a natural structure for verified decomposition: calculus rules explicitly define how expressions reduce to simpler components with provable properties. We introduce Verify-RL, a framework where every parent-child decomposition satisfies three verifiable conditions: strictly decreasing structural complexity, solution containment, and formal rule derivation. Unlike heuristic methods where a significant fraction of decompositions are invalid our properties admit automatic verification through symbolic computation, achieving \"verification by construction\" Experiments demonstrate that eliminating invalid decompositions yields sizable gains, accuracy on the hardest problems more than doubles from 32% to 68%, with a 40% relative improvement overall."}
{"id": "2602.07280", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.07280", "abs": "https://arxiv.org/abs/2602.07280", "authors": ["Victoria Kostina"], "title": "Single-shot lossy compression: mutual information bounds", "comment": null, "summary": "For several styles of fidelity constraints -- guaranteed distortion, conditional excess distortion, excess distortion -- we show mutual information upper bounds on the minimum expected description length needed to represent a random variable. Coupled with the corresponding converses, these results attest that as long as the information content in the data is not too low, minimizing the mutual information under an appropriate fidelity constraint serves as a reasonable proxy for the minimum description length of the data. We provide alternative characterizations of all three convex proxies, shedding light on the structure of their solutions."}
{"id": "2602.08670", "categories": ["cs.CV", "cs.CE", "cs.PF", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.08670", "abs": "https://arxiv.org/abs/2602.08670", "authors": ["Yang Bai"], "title": "A Machine Learning accelerated geophysical fluid solver", "comment": "Master Thesis", "summary": "Machine learning methods have been successful in many areas, like image classification and natural language processing. However, it still needs to be determined how to apply ML to areas with mathematical constraints, like solving PDEs. Among various approaches to applying ML techniques to solving PDEs, the data-driven discretization method presents a promising way of accelerating and improving existing PDE solver on structured grids where it predicts the coefficients of quasi-linear stencils for computing values or derivatives of a function at given positions. It can improve the accuracy and stability of low-resolution simulation compared with using traditional finite difference or finite volume schemes. Meanwhile, it can also benefit from traditional numerical schemes like achieving conservation law by adapting finite volume type formulations. In this thesis, we have implemented the shallow water equation and Euler equation classic solver under a different framework. Experiments show that our classic solver performs much better than the Pyclaw solver. Then we propose four different deep neural networks for the ML-based solver. The results indicate that two of these approaches could output satisfactory solutions."}
{"id": "2602.08714", "categories": ["cs.GT"], "pdf": "https://arxiv.org/pdf/2602.08714", "abs": "https://arxiv.org/abs/2602.08714", "authors": ["Aris Filos-Ratsikas", "Georgios Kalantzis", "Alexandros A. Voudouris"], "title": "Approximate-EFX Allocations with Ordinal and Limited Cardinal Information", "comment": null, "summary": "We study a discrete fair division problem where $n$ agents have additive valuation functions over a set of $m$ goods. We focus on the well-known $α$-EFX fairness criterion, according to which the envy of an agent for another agent is bounded multiplicatively by $α$, after the removal of any good from the envied agent's bundle. The vast majority of the literature has studied $α$-EFX allocations under the assumption that full knowledge of the valuation functions of the agents is available. Motivated by the established literature on the distortion in social choice, we instead consider $α$-EFX algorithms that operate under limited information on these functions. In particular, we assume that the algorithm has access to the ordinal preference rankings, and is allowed to make a small number of queries to obtain further access to the underlying values of the agents for the goods. We show (near-optimal) tradeoffs between the values of $α$ and the number of queries required to achieve those, with a particular focus on constant EFX approximations. We also consider two interesting special cases, namely instances with a constant number of agents, or with two possible values, and provide improved positive results."}
{"id": "2602.07782", "categories": ["cs.GR"], "pdf": "https://arxiv.org/pdf/2602.07782", "abs": "https://arxiv.org/abs/2602.07782", "authors": ["Floria Gu", "Nicholas Vining", "Alla Sheffer"], "title": "TABI: Tight and Balanced Interactive Atlas Packing", "comment": null, "summary": "Atlas packing is a key step in many computer graphics applications. Packing algorithms seek to arrange a set of charts within a fixed-size atlas with as little downscaling as possible. Many packing applications such as content creation tools, dynamic atlas generation for video games, and texture space shading require on-the-fly interactive atlas packing. Unfortunately, while many methods have been developed for generating tight high-quality packings, they are designed for offline settings and have running times two or more orders of magnitude greater than what is required for interactive performance. While real-time GPU packing methods exist, they significantly downscale packed charts compared to offline methods. We introduce a GPU packing method that targets interactive speeds, provides packing quality approaching that of offline methods, and supports flexible user control over the tradeoff between performance and quality. We observe that current real-time packing methods leave large gaps between charts and often produce asymmetric, or poorly balanced, packings. These artifacts dramatically degrade packing quality. Our Tight And Balanced method eliminates these artifacts while retaining Interactive performance. TABI generates tight packings by compacting empty space between irregularly shaped charts both horizontally and vertically, using two approximations of chart shape that support efficient parallel processing. We balance packing outputs by automatically adjusting atlas row widths and orientations to accommodate varying chart heights. We show that our method significantly reduces chart downscaling compared to existing interactive methods while remaining orders of magnitude faster than offline alternatives."}
{"id": "2602.07316", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.07316", "abs": "https://arxiv.org/abs/2602.07316", "authors": ["Min Xu", "Qian Chen", "Gennian Ge"], "title": "Network function computation with vector linear target function and security function", "comment": null, "summary": "In this paper, we study the problem of securely computing a function over a network, where both the target function and the security function are vector linear. The network is modeled as a directed acyclic graph. A sink node wishes to compute a function of messages generated by multiple distributed sources, while an eavesdropper can access exactly one wiretap set from a given collection. The eavesdropper must be prevented from obtaining any information about a specified security function of the source messages. The secure computing capacity is the maximum average number of times that the target function can be securely computed with zero error at the sink node with the given collection of wiretap sets and security function for one use of the network. We establish two upper bounds on this capacity, which hold for arbitrary network topologies and for any vector linear target and security functions. These bounds generalize existing results and also lead to a new upper bound when the target function is the sum over a finite field. For the lower bound, when the target function is the sum, we extend an existing method, which transforms a non-secure network code into a secure one, to the case where the security function is vector linear. Furthermore, for a particular class of networks and a vector linear target function, we characterize the required properties of the global encoding matrix to construct a secure vector linear network code."}
{"id": "2602.08871", "categories": ["cs.GT", "cs.DM", "cs.DS"], "pdf": "https://arxiv.org/pdf/2602.08871", "abs": "https://arxiv.org/abs/2602.08871", "authors": ["Ziyi Cai", "D. D. Gao", "Prasanna Ramakrishnan", "Kangning Wang"], "title": "Distortion of Metric Voting with Bounded Randomness", "comment": null, "summary": "We study the design of voting rules in the metric distortion framework. It is known that any deterministic rule suffers distortion of at least $3$, and that randomized rules can achieve distortion strictly less than $3$, often at the cost of reduced transparency and interpretability. In this work, we explore the trade-off between these paradigms by asking whether it is possible to break the distortion barrier of $3$ using only \"bounded\" randomness. We answer in the affirmative by presenting a voting rule that (1) achieves distortion of at most $3 - \\varepsilon$ for some absolute constant $\\varepsilon > 0$, and (2) selects a winner uniformly at random from a deterministically identified list of constant size. Our analysis builds on new structural results for the distortion and approximation of Maximal Lotteries and Stable Lotteries."}
{"id": "2602.07853", "categories": ["cs.GR"], "pdf": "https://arxiv.org/pdf/2602.07853", "abs": "https://arxiv.org/abs/2602.07853", "authors": ["Xiang Feng", "Yunuo Chen", "Chang Yu", "Hao Su", "Demetri Terzopoulos", "Yin Yang", "Joe Masterjohn", "Alejandro Castro", "Chenfanfu Jiang"], "title": "MPM Lite: Linear Kernels and Integration without Particles", "comment": "19 pages", "summary": "In this paper, we introduce MPM Lite, a new hybrid Lagrangian/Eulerian method that eliminates the need for particle-based quadrature at solve time. Standard MPM practices suffer from a performance bottleneck where expensive implicit solves are proportional to particle-per-cell (PPC) counts due to the the choices of particle-based quadrature and wide-stencil kernels. In contrast, MPM Lite treats particles primarily as carriers of kinematic state and material history. By conceptualizing the background Cartesian grid as a voxel hexahedral mesh, we resample particle states onto fixed-location quadrature points using efficient, compact linear kernels. This architectural shift allows force assembly and the entire time-integration process to proceed without accessing particles, making the solver complexity no longer relate to particles. At the core of our method is a novel stress transfer and stretch reconstruction strategy. To avoid non-physical averaging of deformation gradients, we resample the extensive Kirchhoff stress and derive a rotation-free deformation reference solution, which naturally supports an optimization-based incremental potential formulation. Consequently, MPM Lite can be implemented as modular resampling units coupled with an FEM-style integration module, enabling the direct use of off-the-shelf nonlinear solvers, preconditioners, and unambiguous boundary conditions. We demonstrate through extensive experiments that MPM Lite preserves the robustness and versatility of traditional MPM across diverse materials while delivering significant speedups in implicit settings and improving explicit settings at the same time. Check our project page at https://mpmlite.github.io."}
{"id": "2602.08094", "categories": ["cs.GR", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.08094", "abs": "https://arxiv.org/abs/2602.08094", "authors": ["Kevin You", "Juntian Zheng", "Minchen Li"], "title": "Energy-Controllable Time Integration for Elastodynamic Contact", "comment": null, "summary": "Dynamic simulation of elastic bodies is a longstanding task in engineering and computer graphics. In graphics, numerical integrators like implicit Euler and BDF2 are preferred due to their stability at large time steps, but they tend to dissipate energy uncontrollably. In contrast, symplectic methods like implicit midpoint can conserve energy but are not unconditionally stable and fail on moderately stiff problems. To address these limitations, we propose a general class of numerical integrators for Hamiltonian problems which are symplectic on linear problems, yet have superior stability on nonlinear problems. With this, we derive a novel energy-controllable time integrator, A-search, a simple modification of implicit Euler that can follow user-specified energy targets, enabling flexible control over energy dissipation or conservation while maintaining stability and physical fidelity. Our method integrates seamlessly with barrier-type energies and allows for inversion-free and penetration-free guarantees, making it well-suited for handling large deformations and complex collisions. Extensive evaluations over a wide range of material parameters and scenes demonstrate that A-search has biases to keep energy in low frequency motion rather than dissipation, and A-search outperforms traditional methods such as BDF2 at similar total running times by maintaining energy and leading to more visually desirable simulations."}
{"id": "2602.07421", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.07421", "abs": "https://arxiv.org/abs/2602.07421", "authors": ["Muhammad Fainan Hanif", "Yuanwei Liu"], "title": "Multicasting Pinching Antenna Systems With LoS Blockage", "comment": "The manuscript has been submitted to an IEEE letter/journal for possible publication", "summary": "Pinching-antenna systems (PASS) represent a promising customizable wireless access mechanism in high-frequency bands, enabled by dielectric waveguides and movable dielectric particles, called pinching antennas (PAs). In this work, we study optimal position allocation of PAs in PASS for multicasting in the downlink when a line-of-sight (LoS) link does not necessarily exist between all users and the PAs. The multicasting problem is solved by leveraging minorization-maximization (MM) principle to yield a provably convergent algorithm. In each run of the MM based procedure, we solve a convex surrogate problem using two methods called the candidate search method (CSM) and the bisection search method (BSM). With both BSM and CSM, we not only report superior performance of the multicasting PASS in non-LoS environments compared to conventional antenna systems (CAS), but also determine that BSM yields better overall computational complexity when the number of users and PAs increases. For example, we report that when we have 8 PAs and 25 users, the execution time with the CSM is approximately 2.5 times that with the BSM."}
{"id": "2602.08966", "categories": ["cs.GT"], "pdf": "https://arxiv.org/pdf/2602.08966", "abs": "https://arxiv.org/abs/2602.08966", "authors": ["Hirota Kinoshita", "Ayumi Igarashi"], "title": "Maximin Shares with Lower Quotas", "comment": null, "summary": "We study the fair division of indivisible items among $n$ agents with heterogeneous additive valuations, subject to lower and upper quotas on the number of items allocated to each agent. Such constraints are crucial in various applications, ranging from personnel assignments to computing resource distribution. This paper focuses on the fairness criterion known as maximin shares (MMS) and its approximations. Under arbitrary lower and upper quotas, we show that a $\\left(\\frac{2n}{3n-1}\\right)$-MMS allocation of goods exists and can be computed in polynomial time, while we also present a polynomial-time algorithm for finding a $\\left(\\frac{3n-1}{2n}\\right)$-MMS allocation of chores. Furthermore, we consider the generalized scenario where items are partitioned into multiple categories, each with its own lower and upper quotas. In this setting, our algorithm computes an $\\left(\\frac{n}{2n-1}\\right)$-MMS allocation of goods or a $\\left(\\frac{2n-1}{n}\\right)$-MMS allocation of chores in polynomial time. These results extend previous work on the cardinality constraints, i.e., the special case where only upper quotas are imposed."}
{"id": "2602.08094", "categories": ["cs.GR", "math.NA"], "pdf": "https://arxiv.org/pdf/2602.08094", "abs": "https://arxiv.org/abs/2602.08094", "authors": ["Kevin You", "Juntian Zheng", "Minchen Li"], "title": "Energy-Controllable Time Integration for Elastodynamic Contact", "comment": null, "summary": "Dynamic simulation of elastic bodies is a longstanding task in engineering and computer graphics. In graphics, numerical integrators like implicit Euler and BDF2 are preferred due to their stability at large time steps, but they tend to dissipate energy uncontrollably. In contrast, symplectic methods like implicit midpoint can conserve energy but are not unconditionally stable and fail on moderately stiff problems. To address these limitations, we propose a general class of numerical integrators for Hamiltonian problems which are symplectic on linear problems, yet have superior stability on nonlinear problems. With this, we derive a novel energy-controllable time integrator, A-search, a simple modification of implicit Euler that can follow user-specified energy targets, enabling flexible control over energy dissipation or conservation while maintaining stability and physical fidelity. Our method integrates seamlessly with barrier-type energies and allows for inversion-free and penetration-free guarantees, making it well-suited for handling large deformations and complex collisions. Extensive evaluations over a wide range of material parameters and scenes demonstrate that A-search has biases to keep energy in low frequency motion rather than dissipation, and A-search outperforms traditional methods such as BDF2 at similar total running times by maintaining energy and leading to more visually desirable simulations."}
{"id": "2602.07474", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2602.07474", "abs": "https://arxiv.org/abs/2602.07474", "authors": ["Bitop Maitra", "Murat Kuscu", "Ozgur B. Akan"], "title": "Information Theoretic Modeling of Interspecies Molecular Communication", "comment": null, "summary": "Plants and insects communicate using chemical signals like volatile organic compounds (VOCs). A plant encodes information using different blends of VOCs, which propagate through the air to represent different symbolic information. This communication occurs in a noisy environment, characterized by wind, distance, and complex biological reactions. At the receiver, cross-reactive olfactory receptors produce stochastic binding events whose discretized durations form the receiver observation. In this paper, an information-theoretic framework is developed to model interspecies molecular communication (MC), where receptor responses are modeled probabilistically using a multinomial distribution. Numerical results show that the communication depends on environmental parameters such as wind speed, distance, and the number of released molecules. The proposed framework provides fundamental insights into the VOC-based interspecies communication under realistic biological and environmental conditions."}
{"id": "2602.08558", "categories": ["cs.CV", "cs.GT"], "pdf": "https://arxiv.org/pdf/2602.08558", "abs": "https://arxiv.org/abs/2602.08558", "authors": ["Guan Yuan Tan", "Ngoc Tuan Vu", "Arghya Pal", "Sailaja Rajanala", "Raphael Phan C. -W.", "Mettu Srinivas", "Chee-Ming Ting"], "title": "FLAG-4D: Flow-Guided Local-Global Dual-Deformation Model for 4D Reconstruction", "comment": null, "summary": "We introduce FLAG-4D, a novel framework for generating novel views of dynamic scenes by reconstructing how 3D Gaussian primitives evolve through space and time. Existing methods typically rely on a single Multilayer Perceptron (MLP) to model temporal deformations, and they often struggle to capture complex point motions and fine-grained dynamic details consistently over time, especially from sparse input views. Our approach, FLAG-4D, overcomes this by employing a dual-deformation network that dynamically warps a canonical set of 3D Gaussians over time into new positions and anisotropic shapes. This dual-deformation network consists of an Instantaneous Deformation Network (IDN) for modeling fine-grained, local deformations and a Global Motion Network (GMN) for capturing long-range dynamics, refined through mutual learning. To ensure these deformations are both accurate and temporally smooth, FLAG-4D incorporates dense motion features from a pretrained optical flow backbone. We fuse these motion cues from adjacent timeframes and use a deformation-guided attention mechanism to align this flow information with the current state of each evolving 3D Gaussian. Extensive experiments demonstrate that FLAG-4D achieves higher-fidelity and more temporally coherent reconstructions with finer detail preservation than state-of-the-art methods."}
{"id": "2602.08642", "categories": ["cs.GR"], "pdf": "https://arxiv.org/pdf/2602.08642", "abs": "https://arxiv.org/abs/2602.08642", "authors": ["Martin Bálint", "Corentin Salaün", "Hans-Peter Seidel", "Karol Myszkowski"], "title": "Forget Superresolution, Sample Adaptively (when Path Tracing)", "comment": null, "summary": "Real-time path tracing increasingly operates under extremely low sampling budgets, often below one sample per pixel, as rendering complexity, resolution, and frame-rate requirements continue to rise. While super-resolution is widely used in production, it uniformly sacrifices spatial detail and cannot exploit variations in noise, reconstruction difficulty, and perceptual importance across the image. Adaptive sampling offers a compelling alternative, but existing end-to-end approaches rely on approximations that break down in sparse regimes.\n  We introduce an end-to-end adaptive sampling and denoising pipeline explicitly designed for the sub-1-spp regime. Our method uses a stochastic formulation of sample placement that enables gradient estimation despite discrete sampling decisions, allowing stable training of a neural sampler at low sampling budgets. To better align optimization with human perception, we propose a tonemapping-aware training pipeline that integrates differentiable filmic operators and a state-of-the-art perceptual loss, preventing oversampling of regions with low visual impact.\n  In addition, we introduce a gather-based pyramidal denoising filter and a learnable generalization of albedo demodulation tailored to sparse sampling. Our results show consistent improvements over uniform sparse sampling, with notably better reconstruction of perceptually critical details such as specular highlights and shadow boundaries, and demonstrate that adaptive sampling remains effective even at minimal budgets."}
{"id": "2602.07509", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2602.07509", "abs": "https://arxiv.org/abs/2602.07509", "authors": ["Ruiqi Wang", "Zhen Gao", "Keke Ying", "Ziwei Wan", "Symeon Chatzinotas", "Mohamed-Slim Alouini"], "title": "Transformer-based Hybrid Beamforming with Dynamic Subarray for Near-Space Airship-Borne Communications", "comment": "5 pages, 5 figures, published by IEEE journal", "summary": "This paper proposes a hybrid beamforming framework for massive multiple-input multiple-output (MIMO) in near-space airship-borne communications. To achieve high energy efficiency (EE) in energy-constraint airships, a dynamic subarray structure is introduced, where each radio frequency chain (RFC) is connected to a disjoint subset of the antennas according to channel state information (CSI). The proposed joint dynamic hybrid beamforming network (DyHBFNet) comprises three key components: 1) An analog beamforming network (ABFNet) that optimizes the analog beamforming matrices and provides auxiliary information for the antenna selection network (ASNet) design, 2) an ASNet that dynamically optimizes the connections between antennas and RFCs, and 3) a digital beamforming network (DBFNet) that optimizes digital beamforming matrices by employing a model-driven weighted minimum mean square error algorithm for improving beamforming performance and convergence speed. The proposed ABFNet, ASNet, and DBFNet are all designed based on advanced Transformer encoders. Simulation results demonstrate that the proposed framework significantly enhances spectral efficiency and EE compared to baseline schemes. Additionally, its robust performance under imperfect CSI makes it a scalable solution for practical implementations."}
{"id": "2602.07198", "categories": ["cs.CV", "cs.GR"], "pdf": "https://arxiv.org/pdf/2602.07198", "abs": "https://arxiv.org/abs/2602.07198", "authors": ["Heyuan Li", "Huimin Zhang", "Yuda Qiu", "Zhengwentai Sun", "Keru Zheng", "Lingteng Qiu", "Peihao Li", "Qi Zuo", "Ce Chen", "Yujian Zheng", "Yuming Gu", "Zilong Dong", "Xiaoguang Han"], "title": "Condition Matters in Full-head 3D GANs", "comment": "Accepted by ICLR 2026. Project page: https://lhyfst.github.io/balancehead/", "summary": "Conditioning is crucial for stable training of full-head 3D GANs. Without any conditioning signal, the model suffers from severe mode collapse, making it impractical to training. However, a series of previous full-head 3D GANs conventionally choose the view angle as the conditioning input, which leads to a bias in the learned 3D full-head space along the conditional view direction. This is evident in the significant differences in generation quality and diversity between the conditional view and non-conditional views of the generated 3D heads, resulting in global incoherence across different head regions. In this work, we propose to use view-invariant semantic feature as the conditioning input, thereby decoupling the generative capability of 3D heads from the viewing direction. To construct a view-invariant semantic condition for each training image, we create a novel synthesized head image dataset. We leverage FLUX.1 Kontext to extend existing high-quality frontal face datasets to a wide range of view angles. The image clip feature extracted from the frontal view is then used as a shared semantic condition across all views in the extended images, ensuring semantic alignment while eliminating directional bias. This also allows supervision from different views of the same subject to be consolidated under a shared semantic condition, which accelerates training and enhances the global coherence of the generated 3D heads. Moreover, as GANs often experience slower improvements in diversity once the generator learns a few modes that successfully fool the discriminator, our semantic conditioning encourages the generator to follow the true semantic distribution, thereby promoting continuous learning and diverse generation. Extensive experiments on full-head synthesis and single-view GAN inversion demonstrate that our method achieves significantly higher fidelity, diversity, and generalizability."}
{"id": "2602.07601", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.07601", "abs": "https://arxiv.org/abs/2602.07601", "authors": ["Adi Levy", "Roni Con", "Eitan Yaakobi", "Han Mao Kiah"], "title": "Expected Recovery Time in DNA-based Distributed Storage Systems", "comment": null, "summary": "We initiate the study of DNA-based distributed storage systems, where information is encoded across multiple DNA data storage containers to achieve robustness against container failures. In this setting, data are distributed over $M$ containers, and the objective is to guarantee that the contents of any failed container can be reliably reconstructed from the surviving ones. Unlike classical distributed storage systems, DNA data storage containers are fundamentally constrained by sequencing technology, since each read operation yields the content of a uniformly random sampled strand from the container. Within this framework, we consider several erasure-correcting codes and analyze the expected recovery time of the data stored in a failed container. Our results are obtained by analyzing generalized versions of the classical Coupon Collector's Problem, which may be of independent interest."}
{"id": "2602.07272", "categories": ["cs.CV", "cs.GR"], "pdf": "https://arxiv.org/pdf/2602.07272", "abs": "https://arxiv.org/abs/2602.07272", "authors": ["Bowen Xue", "Saeed Hadadan", "Zheng Zeng", "Fabrice Rousselle", "Zahra Montazeri", "Milos Hasan"], "title": "VideoNeuMat: Neural Material Extraction from Generative Video Models", "comment": null, "summary": "Creating photorealistic materials for 3D rendering requires exceptional artistic skill. Generative models for materials could help, but are currently limited by the lack of high-quality training data. While recent video generative models effortlessly produce realistic material appearances, this knowledge remains entangled with geometry and lighting. We present VideoNeuMat, a two-stage pipeline that extracts reusable neural material assets from video diffusion models. First, we finetune a large video model (Wan 2.1 14B) to generate material sample videos under controlled camera and lighting trajectories, effectively creating a \"virtual gonioreflectometer\" that preserves the model's material realism while learning a structured measurement pattern. Second, we reconstruct compact neural materials from these videos through a Large Reconstruction Model (LRM) finetuned from a smaller Wan 1.3B video backbone. From 17 generated video frames, our LRM performs single-pass inference to predict neural material parameters that generalize to novel viewing and lighting conditions. The resulting materials exhibit realism and diversity far exceeding the limited synthetic training data, demonstrating that material knowledge can be successfully transferred from internet-scale video models into standalone, reusable neural 3D assets."}
{"id": "2602.07630", "categories": ["cs.IT", "cs.DC"], "pdf": "https://arxiv.org/pdf/2602.07630", "abs": "https://arxiv.org/abs/2602.07630", "authors": ["Taotao Wang", "Long Shi", "Fang Liu", "Qing Yang", "Shengli Zhang"], "title": "Wireless Streamlet: A Spectrum-Aware and Cognitive Consensus Protocol for Edge IoT", "comment": "15 pages, 14 figures and 4 tables", "summary": "Blockchain offers a decentralized trust framework for the Internet of Things (IoT), yet deploying consensus in spectrum-congested and dynamic wireless edge IoT networks faces fundamental obstacles: traditional BFT protocols are spectrum-ignorant, leading to inefficient resource utilization and fragile progress under time-varying interference. This paper presents \\textit{Wireless Streamlet}, a spectrum-aware and cognitive consensus protocol tailored for wireless edge IoT. Building on Streamlet's streamlined structure, we introduce a \\textit{Channel-Aware Leader Election (CALE)} mechanism. CALE serves as a verifiable cross-layer cognitive engine that leverages receiver-measured channel state information (CSI) piggybacked in signed votes to derive Byzantine-robust connectivity scores from notarization certificates, and deterministically selects a unique weighted leader per epoch from finalized history, thereby improving proposal dissemination reliability under deep fading. Complementing this cognitive adaptation, Wireless Streamlet exploits the single-hop broadcast medium and a deterministic TDMA voting schedule to achieve linear per-epoch on-air transmissions (slot complexity), ensuring deterministic spectral access. To address the communication-storage trade-off, we further propose a coded dual-chain architecture that decouples header-only consensus (State Chain) from payload data (Data Chain). By employing erasure coding and on-chain integrity commitments, the system minimizes redundant spectrum usage for data retrieval while ensuring availability. Experiments show that Wireless Streamlet achieves higher throughput and lower confirmation latency than representative baselines in lossy environments, while substantially reducing per-node storage, demonstrating the efficacy of integrating cognitive sensing into consensus logic."}
{"id": "2602.07860", "categories": ["cs.CV", "cs.GR"], "pdf": "https://arxiv.org/pdf/2602.07860", "abs": "https://arxiv.org/abs/2602.07860", "authors": ["Fei Yu", "Shudan Guo", "Shiqing Xin", "Beibei Wang", "Haisen Zhao", "Wenzheng Chen"], "title": "Recovering 3D Shapes from Ultra-Fast Motion-Blurred Images", "comment": "Accepted by 3DV 2026. Project page: https://maxmilite.github.io/rec-from-ultrafast-blur/", "summary": "We consider the problem of 3D shape recovery from ultra-fast motion-blurred images. While 3D reconstruction from static images has been extensively studied, recovering geometry from extreme motion-blurred images remains challenging. Such scenarios frequently occur in both natural and industrial settings, such as fast-moving objects in sports (e.g., balls) or rotating machinery, where rapid motion distorts object appearance and makes traditional 3D reconstruction techniques like Multi-View Stereo (MVS) ineffective.\n  In this paper, we propose a novel inverse rendering approach for shape recovery from ultra-fast motion-blurred images. While conventional rendering techniques typically synthesize blur by averaging across multiple frames, we identify a major computational bottleneck in the repeated computation of barycentric weights. To address this, we propose a fast barycentric coordinate solver, which significantly reduces computational overhead and achieves a speedup of up to 4.57x, enabling efficient and photorealistic simulation of high-speed motion. Crucially, our method is fully differentiable, allowing gradients to propagate from rendered images to the underlying 3D shape, thereby facilitating shape recovery through inverse rendering.\n  We validate our approach on two representative motion types: rapid translation and rotation. Experimental results demonstrate that our method enables efficient and realistic modeling of ultra-fast moving objects in the forward simulation. Moreover, it successfully recovers 3D shapes from 2D imagery of objects undergoing extreme translational and rotational motion, advancing the boundaries of vision-based 3D reconstruction. Project page: https://maxmilite.github.io/rec-from-ultrafast-blur/"}
{"id": "2602.07635", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.07635", "abs": "https://arxiv.org/abs/2602.07635", "authors": ["Gergely Flamich", "Deniz Gündüz"], "title": "Data Compression with Stochastic Codes", "comment": null, "summary": "Machine learning has had a major impact on data compression over the last decade and inspired many new, exciting theoretical and applied questions.\n  This paper describes one such direction -- relative entropy coding -- which focuses on constructing stochastic codes, primarily as an alternative to quantisation and entropy coding in lossy source coding. Our primary aim is to provide a broad overview of the topic, with an emphasis on the computational and practical aspects currently missing from the literature.\n  Our goal is threefold: for the curious reader, we aim to provide an intuitive picture of the field and convince them that relative entropy coding is a simple yet exciting emerging field in data compression research. For a reader interested in applied research on lossy data compression, we provide an account of the most salient contemporary applications. Finally, for the reader who has heard of relative entropy coding but has never been quite sure what it is or how the algorithms fit together, we hope to illustrate how simple and elegant the underlying constructions are."}
{"id": "2602.08198", "categories": ["cs.CV", "cs.GR"], "pdf": "https://arxiv.org/pdf/2602.08198", "abs": "https://arxiv.org/abs/2602.08198", "authors": ["Jingyu Hu", "Bin Hu", "Ka-Hei Hui", "Haipeng Li", "Zhengzhe Liu", "Daniel Cohen-Or", "Chi-Wing Fu"], "title": "PEGAsus: 3D Personalization of Geometry and Appearance", "comment": null, "summary": "We present PEGAsus, a new framework capable of generating Personalized 3D shapes by learning shape concepts at both Geometry and Appearance levels. First, we formulate 3D shape personalization as extracting reusable, category-agnostic geometric and appearance attributes from reference shapes, and composing these attributes with text to generate novel shapes. Second, we design a progressive optimization strategy to learn shape concepts at both the geometry and appearance levels, decoupling the shape concept learning process. Third, we extend our approach to region-wise concept learning, enabling flexible concept extraction, with context-aware and context-free losses. Extensive experimental results show that PEGAsus is able to effectively extract attributes from a wide range of reference shapes and then flexibly compose these concepts with text to synthesize new shapes. This enables fine-grained control over shape generation and supports the creation of diverse, personalized results, even in challenging cross-category scenarios. Both quantitative and qualitative experiments demonstrate that our approach outperforms existing state-of-the-art solutions."}
{"id": "2602.07855", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.07855", "abs": "https://arxiv.org/abs/2602.07855", "authors": ["Xinke Jian", "Zhiyuan Ren", "Wenchi Cheng"], "title": "Spectral Graph Analysis for Predicting QoE Fairness Sensitivity in Wireless Communication Networks", "comment": null, "summary": "The evaluation of Quality of Experience (QoE) fairness depends not only on its current state but, more critically, on its sensitivity to changes in Service Level Agreement (SLA) parameters. However, the academic community has long lacked a predictive method connecting underlying topology to high-level service fairness. To bridge this gap, this paper analyzes a QoE imbalance index ($I$) through the lens of spectral graph theory.Our core contribution is the proof of a novel exponential spectral upper bound. This bound reveals that the improvement of QoE fairness exhibits an exponential decay behavior only above a performance threshold determined jointly by network size and connectivity. Its core decay rate is dominated by the weaker of two factors: the SLA stringency ($a$) and the network's spectral gap ($cλ_2$). The upper bound unifies the service protocol and the topological bottleneck within a single performance bound formula for the first time.This theoretical relationship also reveals a clear bottleneck effect, where the system's fairness ceiling is determined by the weaker link between service parameters and network structure. This finding provides a bottleneck-driven principle for resource optimization in network design and enables goal-driven reverse engineering. Extensive numerical experiments on various random graph models and real-world network topologies robustly validate the correctness and universality of our analytical framework."}
{"id": "2602.08540", "categories": ["cs.CV", "cs.GR"], "pdf": "https://arxiv.org/pdf/2602.08540", "abs": "https://arxiv.org/abs/2602.08540", "authors": ["He Wu", "Xia Yan", "Yanghui Xu", "Liegang Xia", "Jiazhou Chen"], "title": "TIBR4D: Tracing-Guided Iterative Boundary Refinement for Efficient 4D Gaussian Segmentation", "comment": "13 pages, 6 figures, 4 tables", "summary": "Object-level segmentation in dynamic 4D Gaussian scenes remains challenging due to complex motion, occlusions, and ambiguous boundaries. In this paper, we present an efficient learning-free 4D Gaussian segmentation framework that lifts video segmentation masks to 4D spaces, whose core is a two-stage iterative boundary refinement, TIBR4D. The first stage is an Iterative Gaussian Instance Tracing (IGIT) at the temporal segment level. It progressively refines Gaussian-to-instance probabilities through iterative tracing, and extracts corresponding Gaussian point clouds that better handle occlusions and preserve completeness of object structures compared to existing one-shot threshold-based methods. The second stage is a frame-wise Gaussian Rendering Range Control (RCC) via suppressing highly uncertain Gaussians near object boundaries while retaining their core contributions for more accurate boundaries. Furthermore, a temporal segmentation merging strategy is proposed for IGIT to balance identity consistency and dynamic awareness. Longer segments enforce stronger multi-frame constraints for stable identities, while shorter segments allow identity changes to be captured promptly. Experiments on HyperNeRF and Neu3D demonstrate that our method produces accurate object Gaussian point clouds with clearer boundaries and higher efficiency compared to SOTA methods."}
{"id": "2602.07866", "categories": ["cs.IT", "math.PR"], "pdf": "https://arxiv.org/pdf/2602.07866", "abs": "https://arxiv.org/abs/2602.07866", "authors": ["Yen-Chi Lee"], "title": "Capacity Scaling Laws for Boundary-Induced Drift-Diffusion Noise Channels", "comment": "This preprint studies boundary-induced additive noise channels arising from drift-diffusion processes and establishes high-power capacity scaling laws", "summary": "This paper studies the high-power capacity scaling of additive noise channels whose noise arises from the first-hitting location of a multidimensional drift-diffusion process on an absorbing hyperplane. By identifying the underlying stochastic transport mechanism as a Gaussian variance-mixture, we introduce and analyze the Normally-Drifted First-Hitting Location (NDFHL) family as a geometry-driven model for boundary-induced noise. Under a second-moment constraint, we derive an exact high-SNR capacity expansion and show that the asymptotic upper and lower bounds coincide at the constant level, yielding a vanishing capacity gap. As a consequence, isotropic Gaussian signaling is asymptotically capacity-achieving for all fixed drift strengths, despite the non-Gaussian and semi-heavy-tailed nature of the noise. The pre-log factor is determined solely by the dimension of the receiving boundary, revealing a geometric origin of the channel's degrees of freedom. The refined expansion further uncovers an entropy-dominant universality, whereby all physical parameters of the transport process -- including drift strength, diffusion coefficient, and boundary separation -- affect the capacity only through the differential entropy of the induced noise. Although the NDFHL density does not admit a simple closed form, its entropy is shown to be finite and to vary continuously as the drift vanishes, thereby connecting the finite-variance regime with the singular infinite-variance Cauchy limit. Together, these results provide a unified geometric and information-theoretic characterization of boundary-hitting channels across both regular and singular transport regimes."}
{"id": "2602.08724", "categories": ["cs.CV", "cs.GR"], "pdf": "https://arxiv.org/pdf/2602.08724", "abs": "https://arxiv.org/abs/2602.08724", "authors": ["Geng Lin", "Matthias Zwicker"], "title": "Rotated Lights for Consistent and Efficient 2D Gaussians Inverse Rendering", "comment": "Project Page: https://rotlight-ir.github.io/", "summary": "Inverse rendering aims to decompose a scene into its geometry, material properties and light conditions under a certain rendering model. It has wide applications like view synthesis, relighting, and scene editing. In recent years, inverse rendering methods have been inspired by view synthesis approaches like neural radiance fields and Gaussian splatting, which are capable of efficiently decomposing a scene into its geometry and radiance. They then further estimate the material and lighting that lead to the observed scene radiance. However, the latter step is highly ambiguous and prior works suffer from inaccurate color and baked shadows in their albedo estimation albeit their regularization. To this end, we propose RotLight, a simple capturing setup, to address the ambiguity. Compared to a usual capture, RotLight only requires the object to be rotated several times during the process. We show that as few as two rotations is effective in reducing artifacts. To further improve 2DGS-based inverse rendering, we additionally introduce a proxy mesh that not only allows accurate incident light tracing, but also enables a residual constraint and improves global illumination handling. We demonstrate with both synthetic and real world datasets that our method achieves superior albedo estimation while keeping efficient computation."}
{"id": "2602.07870", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.07870", "abs": "https://arxiv.org/abs/2602.07870", "authors": ["Kaijun Feng", "Ziwei Wan", "Anwen Liao", "Wenyan Ma", "Lipeng Zhu", "Zhenyu Xiao", "Zhen Gao", "Rui Zhang"], "title": "Deep learning based Channel Estimation and Beamforming in Movable Antenna Systems", "comment": "6 pages, 6 figures, The codes about this work are available at https://github.com/ZiweiWan/Code_4_DL_MA_CE_BF/", "summary": "Movable antenna (MA) has emerged as a promising technology for future wireless systems. Compared with traditional fixed-position antennas, MA improves system performance by antenna movement to optimize channel conditions. For multiuser wideband MA systems, this paper proposes deep learning-based framework integrating channel estimation (CE), antenna position optimization, and beamforming, with a clear workflow and enhanced efficiency. Specifically, to obtain accurate channel state information (CSI), we design a two-stage CE mechanism: first reconstructing the channel matrix from limited measurements via compressive sensing, then introducing a Swin-Transformer-based denoising network to refine CE accuracy for subsequent optimization. Building on this, we address the joint optimization challenge by proposing a Transformer-based network that intelligently maps CSI sequences of candidate positions to optimal MA positions while combining a model-driven weighted minimum mean square error (WMMSE) beamforming approach to achieve better performance. Simulation results demonstrate that the proposed methods achieve superior performance compared with existing counterparts under various conditions. The codes about this work are available at https://github.com/ZiweiWan/Code-4-DL-MA-CE-BF."}
{"id": "2602.07881", "categories": ["cs.IT", "cs.AI"], "pdf": "https://arxiv.org/pdf/2602.07881", "abs": "https://arxiv.org/abs/2602.07881", "authors": ["Yu Ding", "Yulin Shao"], "title": "Deep Variable-Length Feedback Codes", "comment": null, "summary": "Deep learning has enabled significant advances in feedback-based channel coding, yet existing learned schemes remain fundamentally limited: they employ fixed block lengths, suffer degraded performance at high rates, and cannot fully exploit the adaptive potential of feedback. This paper introduces Deep Variable-Length Feedback (DeepVLF) coding, a flexible coding framework that dynamically adjusts transmission length via learned feedback. We propose two complementary architectures: DeepVLF-R, where termination is receiver-driven, and DeepVLF-T, where the transmitter controls termination. Both architectures leverage bit-group partitioning and transformer-based encoder-decoder networks to enable fine-grained rate adaptation in response to feedback. Evaluations over AWGN and 5G-NR fading channels demonstrate that DeepVLF substantially outperforms state-of-the-art learned feedback codes. It achieves the same block error rate with 20%-55% fewer channel uses and lowers error floors by orders of magnitude, particularly in high-rate regimes. Encoding dynamics analysis further reveals that the models autonomously learn a two-phase strategy analogous to classical Schalkwijk-Kailath coding: an initial information-carrying phase followed by a noise-cancellation refinement phase. This emergent behavior underscores the interpretability and information-theoretic alignment of the learned codes."}
{"id": "2602.07886", "categories": ["cs.IT", "cs.AI"], "pdf": "https://arxiv.org/pdf/2602.07886", "abs": "https://arxiv.org/abs/2602.07886", "authors": ["Enhao Chen", "Yulin Shao"], "title": "Rich-ARQ: From 1-bit Acknowledgment to Rich Neural Coded Feedback", "comment": null, "summary": "This paper reimagines the foundational feedback mechanism in wireless communication, transforming the prevailing 1-bit binary ACK/NACK with a high-dimensional, information-rich vector to transform passive acknowledgment into an active collaboration. We present Rich-ARQ, a paradigm that introduces neural-coded feedback for collaborative physical-layer channel coding between transmitter and receiver. To realize this vision in practice, we develop a novel asynchronous feedback code that eliminates stalling from feedback delays, adapts dynamically to channel fluctuations, and features a lightweight encoder suitable for on-device deployment. We materialize this concept into the first full-stack, standard-compliant software-defined radio prototype, which decouples AI inference from strict radio timing. Comprehensive over-the-air experiments demonstrate that Rich-ARQ achieves significant SNR gains over conventional 1-bit hybrid ARQ and remarkable latency reduction over prior learning-based feedback codes, moving the promise of intelligent feedback from theory to a practical, high-performance reality for next-generation networks."}
{"id": "2602.07953", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.07953", "abs": "https://arxiv.org/abs/2602.07953", "authors": ["Heyang Xiong", "Quanzhong Li", "Qi Zhang"], "title": "OFDM Enabled Over-the-Air Computation Systems with Two-Dimensional Fluid Antennas", "comment": null, "summary": "Fluid antenna system (FAS) is able to exploit spatial degrees of freedom (DoFs) in wireless channels. In this letter, to exploit spatial DoFs in frequency-selective environments, we investigate an orthogonal frequency division multiplexing enabled over-the-air computation system, where the access point is equipped with a two-dimensional FAS to enhance performance. We solve the computation mean square error (MSE) minimization problem by transforming the original problem into transmit precoders optimization problem and antenna positions optimization along with receive combiners optimization problem. The latter is solved via a majorization-minimization approach combined with sequential optimization. Numerical results confirm that the proposed scheme achieves MSE reduction over the scheme with fixed position antennas."}
{"id": "2602.07999", "categories": ["cs.IT", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.07999", "abs": "https://arxiv.org/abs/2602.07999", "authors": ["Yanxiao Liu", "Yijun Fan an Deniz Gündüz"], "title": "Tighter Information-Theoretic Generalization Bounds via a Novel Class of Change of Measure Inequalities", "comment": "41 pages, 1 figure", "summary": "In this paper, we propose a novel class of change of measure inequalities via a unified framework based on the data processing inequality for $f$-divergences, which is surprisingly elementary yet powerful enough to yield tighter inequalities. We provide change of measure inequalities in terms of a broad family of information measures, including $f$-divergences (with Kullback-Leibler divergence and $χ^2$-divergence as special cases), Rényi divergence, and $α$-mutual information (with maximal leakage as a special case). We then embed these inequalities into the analysis of generalization error for stochastic learning algorithms, yielding novel and tighter high-probability information-theoretic generalization bounds, while also recovering several best-known results via simplified analyses. A key advantage of our framework is its flexibility: it readily adapts to a range of settings, including the conditional mutual information framework, PAC-Bayesian theory, and differential privacy mechanisms, for which we derive new generalization bounds."}
{"id": "2602.08110", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.08110", "abs": "https://arxiv.org/abs/2602.08110", "authors": ["Søren Riis"], "title": "Term Coding and Dispersion: A Perfect-vs-Rate Complexity Dichotomy for Information Flow", "comment": null, "summary": "We introduce a new framework term coding for extremal problems in discrete mathematics and information flow, where one chooses interpretations of function symbols so as to maximise the number of satisfying assignments of a finite system of term equations.\n  We then focus on dispersion, the special case in which the system defines a term map $Θ^\\mathcal I:\\A^k\\to\\A^r$ and the objective is the size of its image. Writing $n:=|\\A|$, we show that the maximum dispersion is $Θ(n^D)$ for an integer exponent $D$ equal to the guessing number of an associated directed graph, and we give a polynomial-time algorithm to compute $D$. In contrast, deciding whether \\emph{perfect dispersion} ever occurs (i.e.\\ whether $\\Disp_n(\\mathbf t)=n^r$ for some finite $n\\ge 2$) is undecidable once $r\\ge 3$, even though the corresponding asymptotic rate-threshold questions are polynomial-time decidable."}
{"id": "2602.08255", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2602.08255", "abs": "https://arxiv.org/abs/2602.08255", "authors": ["Yizhuo Wang", "Shuowen Zhang"], "title": "Optimal Transmit Beamforming for MIMO ISAC with Unknown Target and User Locations", "comment": "Accepted to appear in IEEE Wireless Communications and Networking Conference (WCNC), 2026", "summary": "This paper studies a challenging scenario in a multiple-input multiple-output (MIMO) integrated sensing and communication (ISAC) system where the locations of the sensing target and the communication user are both unknown and random, while only their probability distribution information is known. In this case, how to fully utilize the spatial resources by designing the transmit beamforming such that both sensing and communication can achieve satisfactory performance statistically is a difficult problem, which motivates the study in this paper. Moreover, we aim to reveal if it is desirable to have similar probability distributions for the target and user locations in terms of the ISAC performance. Firstly, based on only probability distribution information, we establish communication and sensing performance metrics via deriving the expected rate or posterior Cramér-Rao bound (PCRB). Then, we formulate the transmit beamforming optimization problem to minimize the PCRB subject to the expected rate constraint, for which the optimal solution is derived. It is unveiled that the rank of the optimal transmit covariance matrix is upper bounded by the summation of MIMO communication channel matrices for all possible user locations. Furthermore, due to the need to cater to multiple target/user locations, we investigate whether dynamically employing different beamforming designs over different time slots improves the performance. It is proven that using a static beamforming strategy is sufficient for achieving the optimal performance. Numerical results validate our analysis, show that ISAC performance improves as the target/user location distributions become similar, and provide useful insights on the BS-user/-target association strategy."}
{"id": "2602.08391", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2602.08391", "abs": "https://arxiv.org/abs/2602.08391", "authors": ["Yubeen Jo", "Geon Choi", "Chanho Park", "Namyoon Lee"], "title": "Hierarchical Subcode Ensemble Decoding of Polar Codes", "comment": "5 pages, 7 figures", "summary": "Subcode-ensemble decoders improve iterative decoding by running multiple decoders in parallel over carefully chosen subcodes, increasing the likelihood that at least one decoder avoids the dominant trapping structures. Achieving strong diversity gains, however, requires constructing many subcodes that satisfy a linear covering property-yet existing approaches lack a systematic way to scale the ensemble size while preserving this property. This paper introduces hierarchical subcode ensemble decoding (HSCED), a new ensemble decoding framework that expands the number of constituent decoders while still guaranteeing linear covering. The key idea is to recursively generate subcode parity constraints in a hierarchical structure so that coverage is maintained at every level, enabling large ensembles with controlled complexity. To demonstrate its effectiveness, we apply HSCED to belief propagation (BP) decoding of polar codes, where dense parity-check matrices induce severe stopping-set effects that limit conventional BP. Simulations confirm that HSCED delivers significant block-error-rate improvements over standard BP and conventional subcode-ensemble decoding under the same decoding-latency constraint."}
{"id": "2602.08501", "categories": ["cs.IT", "eess.SP"], "pdf": "https://arxiv.org/pdf/2602.08501", "abs": "https://arxiv.org/abs/2602.08501", "authors": ["Yubeen Jo", "Geon Choi", "Yongjune Kim", "Namyoon Lee"], "title": "Multipoint Code-Weight Sphere Decoding: Parallel Near-ML Decoding for Short-Blocklength Codes", "comment": "6 pages, 7 figures", "summary": "Ultra-reliable low-latency communications (URLLC) operate with short packets, where finite-blocklength effects make near-maximum-likelihood (near-ML) decoding desirable but often too costly. This paper proposes a two-stage near-ML decoding framework that applies to any linear block code. In the first stage, we run a low-complexity decoder to produce a candidate codeword and a cyclic redundancy check. When this stage succeeds, we terminate immediately. When it fails, we invoke a second-stage decoder, termed multipoint code-weight sphere decoding (MP-WSD). The central idea behind {MP-WSD} is to concentrate the ML search where it matters. We pre-compute a set of low-weight codewords and use them to generate structured local perturbations of the current estimate. Starting from the first-stage output, MP-WSD iteratively explores a small Euclidean sphere of candidate codewords formed by adding selected low-weight codewords, tightening the search region as better candidates are found. This design keeps the average complexity low: at high signal-to-noise ratio, the first stage succeeds with high probability and the second stage is rarely activated; when it is activated, the search remains localized. Simulation results show that the proposed decoder attains near-ML performance for short-blocklength, low-rate codes while maintaining low decoding latency."}
{"id": "2602.08669", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.08669", "abs": "https://arxiv.org/abs/2602.08669", "authors": ["Johannes Maly", "Anna Veselovska"], "title": "Reliable one-bit quantization of bandlimited graph data via single-shot noise shaping", "comment": null, "summary": "Graph data are ubiquitous in natural sciences and machine learning. In this paper, we consider the problem of quantizing graph structured, bandlimited data to few bits per entry while preserving its information under low-pass filtering. We propose an efficient single-shot noise shaping method that achieves state-of-the-art performance and comes with rigorous error bounds. In contrast to existing methods it allows reliable quantization to arbitrary bit-levels including the extreme case of using a single bit per data coefficient."}
{"id": "2602.08718", "categories": ["cs.IT", "cs.DS", "math.CO"], "pdf": "https://arxiv.org/pdf/2602.08718", "abs": "https://arxiv.org/abs/2602.08718", "authors": ["Yubin Zhu", "Zitan Chen"], "title": "Trellis codes with a good distance profile constructed from expander graphs", "comment": null, "summary": "We derive Singleton-type bounds on the free distance and column distances of trellis codes. Our results show that, at a given time instant, the maximum attainable column distance of trellis codes can exceed that of convolutional codes. Moreover, using expander graphs, we construct trellis codes over constant-size alphabets that achieve a rate-distance trade-off arbitrarily close to that of convolutional codes with a maximum distance profile. By comparison, all known constructions of convolutional codes with a maximum distance profile require working over alphabets whose size grows at least exponentially with the number of output symbols per time instant."}
{"id": "2602.08952", "categories": ["cs.IT"], "pdf": "https://arxiv.org/pdf/2602.08952", "abs": "https://arxiv.org/abs/2602.08952", "authors": ["Aniruddh Pandav", "Rajshekhar V Bhat"], "title": "Clique-Based Deletion-Correcting Codes via Penalty-Guided Clique Search", "comment": null, "summary": "We study the construction of $d$-deletion-correcting binary codes by formulating the problem as a Maximum Clique Problem (MCP). In this formulation, vertices represent candidate codewords and edges connect pairs whose longest common subsequence (LCS) distance guarantees correction of up to $d$ deletions. A valid codebook corresponds to a clique in the resulting graph, and finding the largest codebook is equivalent to identifying a maximum clique. While MCP-based formulations for deletion-correcting codes have previously been explored, we demonstrate that applying Penalty-Guided Clique Search (PGCS), a lightweight stochastic clique-search heuristic inspired by Dynamic Local Search (DLS), consistently yields larger codebooks than existing graph-based heuristics, including minimum-degree and coloring methods, for block lengths $n = 8,9,\\dots,14$ and deletion parameters $d = 1,2,3$. In several finite-length regimes, the resulting codebooks match known optimal sizes and outperform classical constructions such as Helberg codes. For decoding under segmented reception, where codeword boundaries are known, we propose an optimized LCS-based decoder that exploits symbol-count filtering and early termination to substantially reduce the number of LCS evaluations while preserving exact decoding guarantees. These optimizations lead to significantly lower average-case decoding complexity than the baseline $O(|C| n^2)$ approach."}
